In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_excel("filtered_transactions.xlsx")

In [ ]:
df

### Summarize Data

In [ ]:
df.info()   # for information

In [ ]:
df.describe()  # numerical data given

In [ ]:
df ["amount"].describe()

### sorting

In [ ]:
df.sort_values(by="amount" , ascending=True) # sort by amount in asending order

In [ ]:
df.sort_values(by = "amount" , ascending=False) # sort by amount in dending order

In [ ]:
df.sort_values(by="name" , ascending=True , inplace = True) # inplace true se original data set me change hota hai

In [ ]:
df

In [ ]:
df.sort_values(by = ["name" , "amount"] , ascending=[True,False] , inplace=True)
df

### Filtering

In [ ]:
df

In [ ]:
df[df["amount"] > 1000]

In [ ]:
df["name"][df["amount"] > 1000]

In [ ]:
df["category"] == "B"

In [ ]:
df[(df["amount"] > 1000) & (df["category"] == "B")]

### Aggregation Function

In [ ]:
print(df["amount"].min())

In [ ]:
print(df["amount"].max())

In [ ]:
df["amount"].mean()

In [ ]:
df["amount"].sum()

In [ ]:
df["amount"].count()

In [ ]:
df["name"][df["amount"] == df["amount"].max()]

## join & Merge data

### type if merge

- inner (matching)
- outer (full)
- left  (left side all and from in right side that part which is available in left round  )
- right (right side all and from in left side that part which is available in right round )

In [ ]:
df1 = pd.DataFrame({
    "Id" : [1 , 2 , 3],
    "Name" : ["charlie" , "Bob" , "John"],
})

In [ ]:
df1

In [ ]:

df2 =pd.DataFrame({
   "Id" : [ 2, 3 , 4] ,
    "Age" :[  20 , 25 , 60]
})

In [ ]:
df2

In [ ]:
pd.merge(df1 , df2 , on="Id" , how = "left")

In [ ]:
pd.merge(df1 , df2 , on="Id" , how = "right")

In [ ]:
pd.merge(df1 , df2 , on="Id" , how = "inner")

In [ ]:
pd.merge(df1 , df2 , on="Id" , how = "outer")

In [ ]:
pd.merge(df1 , df2)  # by dafult merge by inner

In [ ]:
df1.merge(df2)

#### join

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3 = df1.set_index("Id")

In [138]:
df3

       Name
Id
1   charlie
2       Bob
3      John

In [ ]:
df4 = df2.set_index("Id")

In [139]:
df4

    Age
Id
2    20
3    25
4    60

In [140]:
df3.join(df4, how='inner')

    Name  Age
Id
2    Bob   20
3   John   25

In [141]:
df3

       Name
Id
1   charlie
2       Bob
3      John

In [142]:
df3.join(df4 , how = "inner")

    Name  Age
Id
2    Bob   20
3   John   25

In [143]:
df3.join(df4 , how = "outer")

       Name   Age
Id
1   charlie   NaN
2       Bob  20.0
3      John  25.0
4       NaN  60.0

In [144]:
df3.join(df4 , how = "left")

       Name   Age
Id
1   charlie   NaN
2       Bob  20.0
3      John  25.0

In [145]:
df3.join(df4 , how = "right")

    Name  Age
Id
2    Bob   20
3   John   25
4    NaN   60